In [1]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd
import numpy as np

In [2]:
dict = {
    'ID' : np.arange(11101,11107),
    'Nama Produk' : ['Tomat', 'Apel', 'Pisang', 'Semangka', 'Melon', 'Jeruk'],
}
np.arange(11101,11107)

array([11101, 11102, 11103, 11104, 11105, 11106])

In [3]:
data = pd.DataFrame(dict)
data

      ID Nama Produk
0  11101       Tomat
1  11102        Apel
2  11103      Pisang
3  11104    Semangka
4  11105       Melon
5  11106       Jeruk

In [16]:
# Mengubah tipe data numerik menjadi kategorik
cat = OneHotEncoder() #sparse digunakan untuk mengubah kategorik menjadi array seperti hasil dibawah ini
cat = cat.fit_transform(data[['Nama Produk']])
cat = cat.toarray()
cat
#Transformasi binner dibawah diurukan berdasarkan abjad nama produk berarti apel adaalah kolom pertama dan kolom terakhir adalah tomat

array([[0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0.]])

In [17]:
data_cat = pd.DataFrame(cat)
data_cat

     0    1    2    3    4    5
0  0.0  0.0  0.0  0.0  0.0  1.0
1  1.0  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  1.0  0.0  0.0
3  0.0  0.0  0.0  0.0  1.0  0.0
4  0.0  0.0  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0  0.0  0.0

In [20]:
header = data['Nama Produk'].sort_values()
data_cat.columns = 'Produk_' + header
data_cat

Nama Produk,Produk_Apel,Produk_Jeruk,Produk_Melon,Produk_Pisang,Produk_Semangka,Produk_Tomat
0,0.0,0.0,0.0,0.0,0.0,1.0
1,1.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,1.0,0.0,0.0
3,0.0,0.0,0.0,0.0,1.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0
5,0.0,1.0,0.0,0.0,0.0,0.0

In [22]:
data_join = data.join(data_cat)
data_join

,ID,Nama Produk,Produk_Apel,Produk_Jeruk,Produk_Melon,Produk_Pisang,Produk_Semangka,Produk_Tomat
0,11101,Tomat,0.0,0.0,0.0,0.0,0.0,1.0
1,11102,Apel,1.0,0.0,0.0,0.0,0.0,0.0
2,11103,Pisang,0.0,0.0,0.0,1.0,0.0,0.0
3,11104,Semangka,0.0,0.0,0.0,0.0,1.0,0.0
4,11105,Melon,0.0,0.0,1.0,0.0,0.0,0.0
5,11106,Jeruk,0.0,1.0,0.0,0.0,0.0,0.0